plugins/Signature_Wrapping/src/test/resources/signed_rampart_message_soap_1.2.xml

<!--

    WS-Attacker - A Modular Web Services Penetration Testing Framework
    Copyright (C) 2011  Christian Mainka

    This program is free software; you can redistribute it and/or
    modify it under the terms of the GNU General Public License
    as published by the Free Software Foundation; either version 2
    of the License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

-->
<soap:Envelope xmlns:axis="http://axis2" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header><wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature Id="Signature-5" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-3">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>JxrAN1SoUejfElmCpVeSv35DOC4=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#Timestamp-4">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>xQtnDvV5OSuG6ZAcGVB2H6ehqcU=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
AhlAftXEWAwOchl8ubB2mYDmG2mwb5KG5Vom6MztpaFNHGxb7I1HBApKLrzMC9uAEfjLCF6Jpxp3
dXZ+usUYkDJQ1H5iMbLQLTzoKsjNFAC30fhydMzoZb66Eu/fsnw8NHPKRDWyGuIXjlENqO7niN1Q
Zi6lDz+Z4W6tsN3jiVk=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-C9A55361FEAEFBC1FF13329391533675">
<wsse:SecurityTokenReference wsu:Id="STRId-C9A55361FEAEFBC1FF13329391533676" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">MIICuDCCAiGgAwIBAgIBATANBgkqhkiG9w0BAQUFADB8MQswCQYDVQQGEwJERTEMMAoGA1UECAwDTlJXMQ8wDQYDVQQHDAZCb2NodW0xDDAKBgNVBAoMA1JVQjEQMA4GA1UECwwHWFNQUkVTUzEPMA0GA1UEAwwGVGVzdENBMR0wGwYJKoZIhvcNAQkBFg5UZXN0Q0FAeHNwcmVzczAeFw0xMTA4MDcxMjEyNDFaFw0xMjA4MDYxMjEyNDFaMEsxCzAJBgNVBAYTAkRFMQwwCgYDVQQIEwNOUlcxDDAKBgNVBAoTA1JVQjEQMA4GA1UECxMHWFNQUkVTUzEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBANbijRO99DtXzOvjdp4jnXyErO9kdVehGpEOpEWqOFILPD18GcEJzJTKW4cVtBYsmp7QqTVWrFi47dJJPz2fwoB9WGpBbm4ufLAUA4rqNx+pLlmF9Hfk8Is1fdbP0xZQXg5nbrb1ZSfcAxqmtbsGBdV9WKvHjomBHcqMrDMnrc33AgMBAAGjezB5MAkGA1UdEwQCMAAwLAYJYIZIAYb4QgENBB8WHU9wZW5TU0wgR2VuZXJhdGVkIENlcnRpZmljYXRlMB0GA1UdDgQWBBRrbsxJOAq7vP95fcrG2XsydeWp7zAfBgNVHSMEGDAWgBS9VS/73EZbsbTvp/6JnrV6scVelzANBgkqhkiG9w0BAQUFAAOBgQBh5nYPzkfCnt44FpR3GpxQtrROfqKIef04hfudeyNboLiH2dG/Bb8DDygl1iOZKQ5CPx5mpsKOIzGzraWrhhWZ+taAFqGnfjrTcDqL1LSsKEKkFSIJbR6GIIluZOCRs0OUYxsn5lSNubPJsUxiiW2YDMZlbKZX7a6siyPY+pUFjQ==</wsse:KeyIdentifier></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature><wsu:Timestamp wsu:Id="Timestamp-4" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2012-03-28T12:52:33.360Z</wsu:Created><wsu:Expires>2012-03-28T13:17:33.360Z</wsu:Expires></wsu:Timestamp></wsse:Security>


</soap:Header>
   <soap:Body wsu:Id="id-3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <axis:goodbyeName>
         <axis:name>Mr. Know-How</axis:name>
      </axis:goodbyeName>
   </soap:Body>
</soap:Envelope>
